content/resume/README.org
#+TITLE: Yeongho Kim

#+OPTIONS: date:nil

#+LATEX_HEADER: \usepackage[margin=0.7in]{geometry}

#+LATEX_HEADER: \usepackage{titling}
#+LATEX_HEADER: \setlength{\droptitle}{-14ex}

#+LATEX_HEADER: \usepackage{enumitem}

#+LATEX: \pagenumbering{gobble}
#+LATEX: \vspace{-22ex}

#+ATTR_LATEX: :environment itemize :options [itemindent=34.5em,label=\null,itemsep=-1ex]
- yeonghoey@gmail.com
- yeonghoey.com
- github.com/yeonghoey

#+LATEX: \vspace{-8ex}

* Experience
#+LATEX: \vspace{-4ex}
-----
#+LATEX: \vspace{-4ex}

** [[http://company.nexon.com/Eng/][NEXON Korea]] | Data/DevOps Engineer | June 2016 – Present
I was in charge of infrastructure for [[https://durango.nexon.com/en][Durango: Wild Lands]], a seamless open world /MMORPG/.

#+ATTR_LATEX: :environment itemize :options [label=$\circ$,itemsep=-0.5ex]
- Built data pipelines for time series data which are generated by distributed game servers.  \\
  Based on ~Fluentd~, ~Amazon Kinesis Streams~, ~AWS Lambda~, ~Elasticsearch~, ~Spark~ and ~Zeppelin~.
- Managed infrastructure (>200 instances) on ~AWS~ (>15 services) via ~Terraform~.
- Maintained ~Couchbase~, the game's main ~NoSQL~ database, to set up, scale up and out, etc.

** [[http://frograms.com][FROGRAMS]] | Software Engineer  | Nov 2015 – May 2016
I improved code quality of the recommendation engine for [[https://watcha.net/][WATCHA]] and [[https://play.watcha.net][WATCHA PLAY]], a /Netflix/-like recommendation and streaming service in Korea.

#+ATTR_LATEX: :environment itemize :options [label=$\circ$,itemsep=-0.5ex]
- Established ~Scala~ coding standard for the team and introduced code quality tools like
  ~scalafmt~, ~scalariform~, ~Specs2~ and ~ScalaCheck~.
- Refactored lots of codebase which is based on ~Finagle~, high-concurrency ~RPC~ framework by ~Twitter~.

** [[http://company.nexon.com/Eng/][NEXON Korea]] | Game Developer  | Dec 2013 – Nov 2015
I developed an intelligent matchmaking system for [[http://bf.nexon.com][Bubble Fighter]], a casual /TPS/.

#+ATTR_LATEX: :environment itemize :options [label=$\circ$,itemsep=-0.5ex]
- Designed Matchmaking System based on ~TrueSkill~ in ~C++~. \\
  Gave a presentation on [[http://ndcreplay.nexon.com/NDC2015/sessions/NDC2015_0048.html][NDC 2015]] (Korean)
- Wrote anti-hack codes like memory encryption, hash validations for game data, etc.
- Optimized network performance to cope with severe network conditions on localization for Indonesia.

* Skills
#+LATEX: \vspace{-4ex}
-----
#+LATEX: \vspace{-4ex}

** Advanced
#+ATTR_LATEX: :environment itemize :options [label=$\circ$,itemsep=-0.5ex]
- ~Python~, ~Bash~, ~Scala~, ~C++~
- ~Linux~, ~AWS~, ~Terraform~, ~Couchbase~,
- ~Apache Spark~, ~Elasticsearch~

** Intermediate
#+ATTR_LATEX: :environment itemize :options [label=$\circ$,itemsep=-0.5ex]
- ~Docker~, ~Amazon Aurora~, ~MySQL~, ~Redis~

* Education
#+LATEX: \vspace{-4ex}
-----
#+LATEX: \vspace{-4ex}

** Hanyang University, Seoul | 2014
#+ATTR_LATEX: :environment itemize :options [label=$\circ$,itemsep=-0.5ex]
- B.A in /Philosophy/
- B.S in /Computer Science/
