content/resume/README.tex
% Created 2017-10-09 Mon 08:44
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=0.7in]{geometry}
\usepackage{titling}
\setlength{\droptitle}{-14ex}
\usepackage{enumitem}
\date{}
\title{Yeongho Kim}
\hypersetup{
 pdfauthor={Yeongho Kim},
 pdftitle={Yeongho Kim},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.3.1 (Org mode 9.1.1)}, 
 pdflang={English}}
\begin{document}

\maketitle
\pagenumbering{gobble}
\vspace{-22ex}

\begin{itemize}[itemindent=34.5em,label=\null,itemsep=-1ex]
\item yeonghoey@gmail.com
\item yeonghoey.com
\item github.com/yeonghoey
\end{itemize}

\vspace{-8ex}

\section*{Experience}
\label{sec:orgd946ca7}
\vspace{-4ex}

\noindent\rule{\textwidth}{0.5pt}
\vspace{-4ex}

\subsection*{\href{http://company.nexon.com/Eng/}{NEXON Korea} | Data/DevOps Engineer | June 2016 – Present}
\label{sec:org584af19}
I was in charge of infrastructure for \href{https://durango.nexon.com/en}{Durango: Wild Lands}, a seamless open world \emph{MMORPG}.

\begin{itemize}[label=$\circ$,itemsep=-0.5ex]
\item Built data pipelines for time series data which are generated by distributed game servers.  \\
Based on \texttt{Fluentd}, \texttt{Amazon Kinesis Streams}, \texttt{AWS Lambda}, \texttt{Elasticsearch}, \texttt{Spark} and \texttt{Zeppelin}.
\item Managed infrastructure (>200 instances) on \texttt{AWS} (>15 services) via \texttt{Terraform}.
\item Maintained \texttt{Couchbase}, the game's main \texttt{NoSQL} database, to set up, scale up and out, etc.
\end{itemize}

\subsection*{\href{http://frograms.com}{FROGRAMS} | Software Engineer  | Nov 2015 – May 2016}
\label{sec:org8070774}
I improved code quality of the recommendation engine for \href{https://watcha.net/}{WATCHA} and \href{https://play.watcha.net}{WATCHA PLAY}, a \emph{Netflix}-like recommendation and streaming service in Korea.

\begin{itemize}[label=$\circ$,itemsep=-0.5ex]
\item Established \texttt{Scala} coding standard for the team and introduced code quality tools like
\texttt{scalafmt}, \texttt{scalariform}, \texttt{Specs2} and \texttt{ScalaCheck}.
\item Refactored lots of codebase which is based on \texttt{Finagle}, high-concurrency \texttt{RPC} framework by \texttt{Twitter}.
\end{itemize}

\subsection*{\href{http://company.nexon.com/Eng/}{NEXON Korea} | Game Developer  | Dec 2013 – Nov 2015}
\label{sec:orgcd8a472}
I developed an intelligent matchmaking system for \href{http://bf.nexon.com}{Bubble Fighter}, a casual \emph{TPS}.

\begin{itemize}[label=$\circ$,itemsep=-0.5ex]
\item Designed Matchmaking System based on \texttt{TrueSkill} in \texttt{C++}. \\
Gave a presentation on \href{http://ndcreplay.nexon.com/NDC2015/sessions/NDC2015\_0048.html}{NDC 2015} (Korean)
\item Wrote anti-hack codes like memory encryption, hash validations for game data, etc.
\item Optimized network performance to cope with severe network conditions on localization for Indonesia.
\end{itemize}

\section*{Skills}
\label{sec:org1175eb9}
\vspace{-4ex}

\noindent\rule{\textwidth}{0.5pt}
\vspace{-4ex}

\subsection*{Advanced}
\label{sec:org168a6b9}
\begin{itemize}[label=$\circ$,itemsep=-0.5ex]
\item \texttt{Python}, \texttt{Bash}, \texttt{Scala}, \texttt{C++}
\item \texttt{Linux}, \texttt{AWS}, \texttt{Terraform}, \texttt{Couchbase},
\item \texttt{Apache Spark}, \texttt{Elasticsearch}
\end{itemize}

\subsection*{Intermediate}
\label{sec:org7663c0d}
\begin{itemize}[label=$\circ$,itemsep=-0.5ex]
\item \texttt{Docker}, \texttt{Amazon Aurora}, \texttt{MySQL}, \texttt{Redis}
\end{itemize}

\section*{Education}
\label{sec:org1f1c066}
\vspace{-4ex}

\noindent\rule{\textwidth}{0.5pt}
\vspace{-4ex}

\subsection*{Hanyang University, Seoul | 2014}
\label{sec:orgb9b1a05}
\begin{itemize}[label=$\circ$,itemsep=-0.5ex]
\item B.A in \emph{Philosophy}
\item B.S in \emph{Computer Science}
\end{itemize}
\end{document}
